---
kind: type
id: T:Autodesk.Revit.DB.ModelCurveArray
source: html/c7852e5b-0a34-771f-584f-3e9513bca50e.htm
---
# Autodesk.Revit.DB.ModelCurveArray

An array that contains model curves.

## Syntax (C#)
```csharp
public class ModelCurveArray : APIObject,
	IEnumerable
```